from my_library import *
from mnk import *


color_combo_s = [
    ('#000000', '#E69F00', '#56B4E9'),  # Черный, оранжевый, голубой
    ('#009E73', '#D55E00', '#CC79A7'),  # Зеленый, оранжево-красный, розовый
    ('#0072B2', "#F0B642", '#CC79A7'),  # Синий, желтый, розовый
    ('#D55E00', '#009E73', '#56B4E9'),  # Оранжевый, зеленый, голубой
    ('#56B4E9', '#E69F00', '#009E73'),  # Голубой, оранжевый, зеленый
    ('#CC79A7', '#0072B2', "#45F042"),  # Розовый, синий, желтый
    ("#9D0A96", '#D55E00', '#009E73'),  # Желтый, оранжевый, зеленый
    ('#E69F00', '#56B4E9', '#CC79A7'),  # Оранжевый, голубой, розовый
    ('#009E73', '#0072B2', '#D55E00'),  # Зеленый, синий, оранжевый
    ('#CC79A7', "#4245F0", '#56B4E9')   # Розовый, желтый, голубой
]

slovar = get_all_columns_from_file("03_ballistic.csv")

x_es = slovar[1]
i_es = slovar[2]

plt.plot(x_es, i_es)
plt.scatter(x_es, i_es, color="#D55E00")

set_end(x_label="$R + R_0$, кОм", y_label="$x_\\text{max}$, см")